app/Http/Controllers/Properties/CategoryController.php

    public function update(Request $request, string $id)
    {
        $category = Category::find($id);
        if (!$category) {
            Session::flash('error', 'Category not found');
            return back();
        }
        $category->name = $request->name;
        $category->save();
---
update `categories` set `name` = 'household', `categories`.`updated_at` = '2023-12-02 10:25:05' where `id` = 1