app/Http/Controllers/Properties/CategoryController.php

    public function store(Request $request)
    {
        $category = new Category();
        $category->name = $request->name;
        try {
            $category->save();
---
insert into `categories` (`name`, `updated_at`, `created_at`) values ('kelvin', '2023-12-02 09:18:08', '2023-12-02 09:18:08')

    public function destroy(string $id)
    {
        $category = Category::find($id);
        if (!$category) {
            Session::flash('error', 'Category not found');
            return back();
        }

        if ($category->properties->isEmpty()) {
            try {
                $category->delete();
---
select * from `categories` where `categories`.`id` = '1' and `categories`.`deleted_at` is null limit 1
update `categories` set `deleted_at` = '2023-12-02 09:31:06', `categories`.`updated_at` = '2023-12-02 09:31:06' where `id` = 2