app/Http/Controllers/Properties/PropertyController.php

    public function store( Request $request ) {
        $property = new Property();
        $property->name = $request->name;
        $property->description = $request->description;
        $property->category_id = $request->category_id;
        $property->user_id = auth()->user()->id;

        try {
            $property->save();
---
insert into `properties` (`name`, `description`, `category_id`, `user_id`, `updated_at`, `created_at`) values ('Kibanda 01', '', '1', 1, '2023-12-02 12:27:48', '2023-12-02 12:27:48')

    public function update( Request $request, string $id ) {
        $property = Property::find($id);
---
select * from `properties` where `properties`.`id` = '3' and `properties`.`deleted_at` is null limit 1