app/Http/Controllers/Auth/AuthenticationController.php

    public function authenticate(Request $request)
    {
        $user = User::whereEmail($request->email)->first();
---
select * from `users` where `email` = 'kev@mayeye.com' and `users`.`deleted_at` is null limit 1